kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  update_input_string();

  //-----------------------------------------------------------------------------//
  // Prepare bitstream from input string
  //-----------------------------------------------------------------------------//

  make_bitstream_from_string(input_string);

  //-----------------------------------------------------------------------------//
  // Calculate active duration
  //-----------------------------------------------------------------------------//

  calculate_active_duration_ms();

  //-----------------------------------------------------------------------------//
  // Start DAC DMA
  //-----------------------------------------------------------------------------//
  current_bitstream_index = 0;
  current_bit = bitstream[current_bitstream_index];
  next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  current_sine_period = 0;
  current_sine_index = 0;
  tx_active = true;

  //---------------------------------------------------------------------------//
  // Main loop
  //---------------------------------------------------------------------------//

  /* USER CODE END 2 */

  /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity
   */
  BspCOMInit.BaudRate = 115200;
  BspCOMInit.WordLength = COM_WORDLENGTH_8B;
  BspCOMInit.StopBits = COM_STOPBITS_1;
  BspCOMInit.Parity = COM_PARITY_NONE;
  BspCOMInit.HwFlowCtl = COM_HWCONTROL_NONE;
  if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE) {
    Error_Handler();
  }

  /* USER CODE BEGIN BSP */

  /* -- Sample board code to send message over COM1 port ---- */
  printf("\033[2J\033[H");
  printf("-------------------------\r\n");
  printf("Hello from VCP!\r\n");

  /* USER CODE END BSP */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  // printf("-------------------------\r\n");
  // printf("Input string prepared:\r\n%s\r\n", input_string);
  // printf("Bitstream length: %u bits\r\n", BITSTREAM_LENGTH);
  // uint32_t ms = (uint32_t)(total_time * 1000.0f);
  // printf("Active duration: %lu ms\r\n", (unsigned long)ms);
  // printf("Bitstream:\r\n");
  // for (int i = 0; i < BITSTREAM_LENGTH; ++i) {
  //   printf("%u", bitstream[i]);
  // }

  TX_Stop();

  // printf("\r\n");
  // printf("-------------------------\r\n");

  // Set_DAC_Output_To_Midlevel();

  // DS3231_PowerOn();
  // if (HAL_I2C_IsDeviceReady(&hi2c2, DS3231_ADDR, 3, 100) == HAL_OK) {
  //   DS3231_Init();
  //   Set_Time(INITIAL_SEC, INITIAL_MIN, INITIAL_HOUR, INITIAL_DOW,
  //   INITIAL_DOM,
  //            INITIAL_MONTH, INITIAL_YEAR);
  // }
  // Get_Time(&now);
  // printf("-------------------------\r\n");

  // SPI1_Write((uint8_t *)input_string, (uint16_t)strlen(input_string));

  printf("-------------------------\r\n");

  // SPI1_Read((uint8_t *)input_string, (uint16_t)strlen(input_string));

  printf("-------------------------\r\n");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);
  HAL_Delay(5); // let radio settle

  app_radio_test();

  printf("--------------------------\r\n");

  printf("Entering main loop...\r\n");

  while (1) {

    // // 1) Start TX
    // TX_Start();

    // // 2) Calculate active duration
    // calculate_active_duration_ms();
    // printf("Starting transmission for %.2f seconds...\r\n", total_time);

    // // 3) Set an active window timer and wait for completion
    // StartActiveWindowMs((uint32_t)(total_time * 1000.0f));
    // while (!active_done) {
    //   __WFI(); // CPU sleeps while DMA+TIM2+DAC run
    // }
    // active_done = 0;

    // // 4) Stop TX
    // TX_Stop();

    // printf("\r\n");
    // printf("Transmission complete.\r\n");
    // printf("-------------------------\r\n");

    // HAL_Delay(100);

    // 5) Enter STOP mode until button press
    EnterStopMode();

    printf("Woke up!\r\n");

    // 6) Debounce button
    while (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_RESET) {
    }
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
  RCC_OscInitStruct.PLL.PLLN = 8;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
    Error_Handler();
  }
}

/**
 * @brief DAC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_DAC1_Init(void) {

  /* USER CODE BEGIN DAC1_Init 0 */

  /* USER CODE END DAC1_Init 0 */

  DAC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN DAC1_Init 1 */

  /* USER CODE END DAC1_Init 1 */

  /** DAC Initialization
   */
  hdac1.Instance = DAC1;
  if (HAL_DAC_Init(&hdac1) != HAL_OK) {
    Error_Handler();
  }

  /** DAC channel OUT1 config
   */
  sConfig.DAC_HighFrequency = DAC_HIGH_FREQUENCY_INTERFACE_MODE_AUTOMATIC;
  sConfig.DAC_DMADoubleDataMode = DISABLE;
  sConfig.DAC_SignedFormat = DISABLE;
  sConfig.DAC_SampleAndHold = DAC_SAMPLEANDHOLD_DISABLE;
  sConfig.DAC_Trigger = DAC_TRIGGER_T2_TRGO;
  sConfig.DAC_Trigger2 = DAC_TRIGGER_NONE;
  sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
  sConfig.DAC_ConnectOnChipPeripheral = DAC_CHIPCONNECT_EXTERNAL;
  sConfig.DAC_UserTrimming = DAC_TRIMMING_FACTORY;
  if (HAL_DAC_ConfigChannel(&hdac1, &sConfig, DAC_CHANNEL_1) != HAL_OK) {
    Error_Handler();
  }
  /* USER CODE BEGIN DAC1_Init 2 */

  /* USER CODE END DAC1_Init 2 */
}

/**
 * @brief I2C2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C2_Init(void) {

