kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  printf("  TX stopped cleanly (DAC set to mid)\r\n");
}

void Set_DAC_Output_To_Midlevel(void) {
  CLEAR_BIT(DAC1->CR, DAC_CR_TEN1);

  // Ensure DAC channel is enabled
  HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);

  // Set mid-scale (12-bit right aligned)
  HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dc_mid[0]);
}

void app_radio_test(void) {
  radio.hspi = &hspi1;
  radio.cs_port = GPIOA;
  radio.cs_pin = GPIO_PIN_0;

  radio.miso_port = GPIOA;
  radio.miso_pin = GPIO_PIN_6;

  radio.spi_timeout_ms = 50;
  radio.miso_ready_timeout_ms = 10;

  printf("MISO idle=%d\r\n", (int)HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6));

  ism_status_t s;

  s = ism_init(&radio);
  printf("ism_init=%d\r\n", s);

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);
  HAL_Delay(5);
  printf("CS=1 MISO=%d\r\n", HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6));

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET);
  HAL_Delay(5);
  printf("CS=0 MISO=%d\r\n", HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6));

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);
  HAL_Delay(1);
  printf("CS=1 MISO=%d\r\n", HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6));
  HAL_Delay(10);

  s = ism_reset(&radio);
  printf("ism_reset=%d\r\n", s);

  uint8_t part = 0, ver = 0;
  s = ism_read_part_version(&radio, &part, &ver);
  printf("read_pv=%d part=0x%02X ver=0x%02X\r\n", s, part, ver);

  const uint8_t msg[] = "HELLO";
  s = ism_send_packet(&radio, msg, (uint8_t)(sizeof(msg) - 1), false);
  printf("send=%d\r\n", s);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
